Revit 2027 API
MEPBuildingConstructionSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual MEPBuildingConstructionSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As MEPBuildingConstructionSetIterator
public:
virtual MEPBuildingConstructionSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> MEPBuildingConstructionSetIterator
override ReverseIterator : unit -> MEPBuildingConstructionSetIterator
Return Value
MEPBuildingConstructionSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace